pascal-4.0/tutorials/surfaceTracking/interTrackEddyCurrentFoam/inductionBlock3D/0.org/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 0;

boundaryField
{
    infinity
    {
        type            calculated;
        value           $internalField;
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}

// ************************************************************************* //
