pascal-4.0/tutorials/surfaceTracking/interTrackEddyCurrentFoam/inductionBlock3D/constant/interTrackProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      interTrackProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

settings
{
    region_fluid
    {
        volumeForce         true;
        turbulence          true;

        UpCoupled           false;
        UEqnVolumeForce     false;
        snGradpFromFlux     true;
    }
}

storage
{
}

// ************************************************************************* //
